tests/unit/api_contract/_api_checker/test_verification_records/payment_verification_summary.fixture.json

{
    "payment_verification_summary": {
        "master": {
            "model": "payment.paymentverificationsummary",
            "pk": "f696b919-908b-48b6-a403-d937db86b544",
            "fields": {
                "created_at": "2025-01-01T00:00:00Z",
                "updated_at": "2025-01-01T00:00:00Z",
                "status": "PENDING",
                "activation_date": null,
                "completion_date": null,
                "payment_plan": "f6fdb805-6ec5-476d-b72a-d0e8c13b0321"
            }
        },
        "deps": [
            {
                "model": "payment.paymentplan",
                "pk": "f6fdb805-6ec5-476d-b72a-d0e8c13b0321",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315202,
                    "unicef_id": "PP-BA0000-25-00000001",
                    "internal_data": {},
                    "business_area": "3575277d-e9c6-4d1d-8b19-6fe3e8fb636f",
                    "program_cycle": "760b71fe-1ed6-45de-a04f-f7f1c2c2ed9f",
                    "delivery_mechanism": null,
                    "financial_service_provider": null,
                    "imported_file": null,
                    "export_file_entitlement": null,
                    "export_file_per_fsp": null,
                    "export_pdf_file_summary": null,
                    "reconciliation_import_file": null,
                    "steficon_rule": null,
                    "steficon_rule_targeting": null,
                    "created_by": "eb1f335c-0077-49bb-8561-a5fb866709b4",
                    "source_payment_plan": null,
                    "storage_file": null,
                    "name": null,
                    "start_date": null,
                    "end_date": null,
                    "currency": null,
                    "dispersion_start_date": "2025-01-01",
                    "dispersion_end_date": "2025-01-31",
                    "excluded_ids": null,
                    "exclusion_reason": null,
                    "vulnerability_score_min": null,
                    "vulnerability_score_max": null,
                    "abort_comment": "",
                    "status": "FINISHED",
                    "background_action_status": null,
                    "build_status": null,
                    "built_at": null,
                    "exchange_rate": null,
                    "female_children_count": 0,
                    "male_children_count": 0,
                    "female_adults_count": 0,
                    "male_adults_count": 0,
                    "total_households_count": 0,
                    "total_individuals_count": 0,
                    "imported_file_date": null,
                    "total_entitled_quantity": null,
                    "total_entitled_quantity_usd": null,
                    "total_entitled_quantity_revised": null,
                    "total_entitled_quantity_revised_usd": null,
                    "total_delivered_quantity": null,
                    "total_delivered_quantity_usd": null,
                    "total_undelivered_quantity": null,
                    "total_undelivered_quantity_usd": null,
                    "steficon_targeting_applied_date": null,
                    "steficon_applied_date": null,
                    "is_follow_up": false,
                    "exclude_household_error": null,
                    "status_date": "2025-01-01T00:00:00Z",
                    "is_cash_assist": false,
                    "flag_exclude_if_active_adjudication_ticket": false,
                    "flag_exclude_if_on_sanction_list": false
                }
            },
            {
                "model": "core.businessarea",
                "pk": "3575277d-e9c6-4d1d-8b19-6fe3e8fb636f",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "code": "BA0000",
                    "slug": "business-area-0",
                    "name": "Business Area 0",
                    "long_name": "Business Area 0 Long Name",
                    "parent": null,
                    "office_country": null,
                    "is_split": false,
                    "region_code": "64",
                    "region_name": "TEST",
                    "has_data_sharing_agreement": false,
                    "is_accountability_applicable": false,
                    "rdi_import_xlsx_disabled": false,
                    "active": true,
                    "enable_email_notification": true,
                    "kobo_username": null,
                    "kobo_token": null,
                    "kobo_url": null,
                    "rapid_pro_host": null,
                    "rapid_pro_payment_verification_token": null,
                    "rapid_pro_messages_token": null,
                    "rapid_pro_survey_token": null,
                    "postpone_deduplication": false,
                    "deduplication_duplicate_score": 6.0,
                    "deduplication_possible_duplicate_score": 6.0,
                    "deduplication_batch_duplicates_percentage": 50,
                    "deduplication_batch_duplicates_allowed": 5,
                    "deduplication_golden_record_duplicates_percentage": 50,
                    "deduplication_golden_record_duplicates_allowed": 5,
                    "deduplication_ignore_withdraw": false,
                    "biometric_deduplication_threshold": 0.0,
                    "custom_fields": {},
                    "countries": [],
                    "payment_countries": []
                }
            },
            {
                "model": "program.programcycle",
                "pk": "760b71fe-1ed6-45de-a04f-f7f1c2c2ed9f",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "version": 1735688653315201,
                    "unicef_id": "PC-BA0000-25-000001",
                    "title": "Programme Cycle 0",
                    "program": "b2e0d8d6-0278-4276-b23f-3dca1641e806",
                    "status": "ACTIVE",
                    "start_date": "2025-01-01",
                    "end_date": null,
                    "created_by": null
                }
            },
            {
                "model": "program.program",
                "pk": "b2e0d8d6-0278-4276-b23f-3dca1641e806",
                "fields": {
                    "is_removed": false,
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "last_sync_at": null,
                    "version": 1735688653315202,
                    "data_collecting_type": 1,
                    "beneficiary_group": "e9124770-edc2-4621-a3cb-5380ee47a06b",
                    "business_area": "3575277d-e9c6-4d1d-8b19-6fe3e8fb636f",
                    "name": "Program 0",
                    "programme_code": "PC95",
                    "status": "ACTIVE",
                    "slug": "pc95",
                    "description": "",
                    "start_date": "2025-01-01",
                    "end_date": "2026-01-01",
                    "sector": "MULTI_PURPOSE",
                    "budget": "1000000.00",
                    "frequency_of_payments": "ONE_OFF",
                    "scope": null,
                    "partner_access": "SELECTED_PARTNERS_ACCESS",
                    "cash_plus": false,
                    "population_goal": 1000,
                    "administrative_areas_of_implementation": "",
                    "biometric_deduplication_enabled": false,
                    "collision_detector": "hope.apps.program.collision_detectors.NoopCollisionDetector",
                    "identification_key_individual_label": null,
                    "is_visible": true,
                    "household_count": 0,
                    "individual_count": 0,
                    "reconciliation_window_in_days": 0,
                    "send_reconciliation_window_expiry_notifications": false,
                    "admin_areas": [],
                    "sanction_lists": []
                }
            },
            {
                "model": "core.datacollectingtype",
                "pk": 1,
                "fields": {
                    "created": "2025-01-01T00:00:00Z",
                    "modified": "2025-01-01T00:00:00Z",
                    "code": "dct_0",
                    "label": "DCT 0",
                    "type": "STANDARD",
                    "description": "",
                    "active": true,
                    "deprecated": false,
                    "individual_filters_available": false,
                    "household_filters_available": true,
                    "recalculate_composition": false,
                    "weight": 0,
                    "compatible_types": [
                        1
                    ],
                    "limit_to": []
                }
            },
            {
                "model": "program.beneficiarygroup",
                "pk": "e9124770-edc2-4621-a3cb-5380ee47a06b",
                "fields": {
                    "created_at": "2025-01-01T00:00:00Z",
                    "updated_at": "2025-01-01T00:00:00Z",
                    "name": "Group 0",
                    "group_label": "Household",
                    "group_label_plural": "Households",
                    "member_label": "Individual",
                    "member_label_plural": "Individuals",
                    "master_detail": true
                }
            },
            {
                "model": "account.user",
                "pk": "eb1f335c-0077-49bb-8561-a5fb866709b4",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": true,
                    "username": "user_0",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": true,
                    "is_active": true,
                    "date_joined": "2025-01-01T00:00:00Z",
                    "azure_id": null,
                    "display_name": "user_0",
                    "status": "INVITED",
                    "partner": 3,
                    "email": "user_0@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2025-01-01T00:00:00Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 3,
                "fields": {
                    "name": "Partner 0",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 2,
                    "level": 0,
                    "allowed_business_areas": []
                }
            }
        ]
    }
}